LMN-SCUT/NUEDC-2026-Car/controller-stm32/h60-f407-line-car/User/main.c
#include "stm32f4xx.h"
#include "board_config.h"
#include "timebase.h"
#include "key.h"
#include "motor.h"
#include "encoder.h"
#include "speed_pi.h"
#include "motor_protection.h"
#include "newgrey.h"
#include "line_follower.h"
#include "hc05.h"

typedef enum {
    APP_WAIT_START = 0,
    APP_RUNNING,
    APP_FINISHED,
    APP_ERROR
} App_State;

volatile App_State app_state = APP_WAIT_START;
volatile uint32_t run_time_ms;
volatile uint16_t gray_raw[GRAY_SENSOR_COUNT];
volatile uint8_t gray_active_mask;
volatile uint8_t gray_active_count;
volatile uint8_t gray_i2c_raw_mask;
volatile uint8_t gray_i2c_error;
volatile uint8_t gray_i2c_online;
volatile float line_error;
volatile Encoder_Delta encoder_delta_debug;
volatile LineFollower_Status line_status;
volatile uint8_t track_finish_armed;
volatile uint8_t track_finish_detected;

#if APP_MOTOR_TEST_MODE && ENCODER_PI_TEST_ENABLE
/* 判断10秒累计速度是否落在目标的±10%内，只作为闭环初步验收标准。 */
static uint8_t pi_total_within_10_percent(int32_t actual, int32_t target)
{
    int32_t minimum = (target * 90) / 100;
    int32_t maximum = (target * 110) / 100;
    return ((actual >= minimum) && (actual <= maximum)) ? 1U : 0U;
}
#endif

/*
 * H题地图循迹遥测：
 * D/B/N是灰度原始白位图、黑线位图和见黑数量；E是位置误差x100；
 * ST是循迹状态；ARM表示已离开起点A横线；LT/RT是灰度外环目标百分比；
 * TA~TD和EA~ED分别是最近500 ms目标/实际累计计数；
 * PA~PD是四路速度PI当前输出PWM百分比。
 */
#if !APP_MOTOR_TEST_MODE
static void send_wait_test_frame(void)
{
    HC05_SendString("WAIT,K=");
    HC05_SendInt32((int32_t)Key_IsPressed());
    HC05_SendString(",ON=");
    HC05_SendInt32((int32_t)gray_i2c_online);
    HC05_SendString(",I2C=");
    HC05_SendInt32((int32_t)gray_i2c_error);
    HC05_SendString(",D=0x");
    HC05_SendHex8(gray_i2c_raw_mask);
    HC05_SendString(",B=0x");
    HC05_SendHex8(gray_active_mask);
    HC05_SendString(",N=");
    HC05_SendInt32((int32_t)gray_active_count);
    HC05_SendString("\r\n");
}

/* 灰度离线时也持续回传，避免安全停车后的continue形成“串口完全静默”。 */
static void send_gray_fault_frame(void)
{
    HC05_SendString("GRAY_ERROR,AS=");
    HC05_SendInt32((int32_t)app_state);
    HC05_SendString(",K=");
    HC05_SendInt32((int32_t)Key_IsPressed());
    HC05_SendString(",ON=");
    HC05_SendInt32((int32_t)gray_i2c_online);
    HC05_SendString(",I2C=");
    HC05_SendInt32((int32_t)gray_i2c_error);
    HC05_SendString(",RETRY=1\r\n");
}

static void send_track_test_frame(const Encoder_Delta *encoder_sum,
                                  const Encoder_Delta *target_sum,
                                  uint8_t finish_marker_frames)
{
    const SpeedPI_Status *speed = SpeedPI_GetStatus();

    HC05_SendString("MAP,MS=");
    HC05_SendInt32((int32_t)run_time_ms);
    HC05_SendString(",AS=");
    HC05_SendInt32((int32_t)app_state);
    HC05_SendString(",ON=");
    HC05_SendInt32((int32_t)gray_i2c_online);
    HC05_SendString(",I2C=");
    HC05_SendInt32((int32_t)gray_i2c_error);
    HC05_SendString(",D=0x");
    HC05_SendHex8(gray_i2c_raw_mask);
    HC05_SendString(",B=0x");
    HC05_SendHex8(gray_active_mask);
    HC05_SendString(",N=");
    HC05_SendInt32((int32_t)gray_active_count);
    HC05_SendString(",E=");
    HC05_SendInt32((int32_t)(line_error * 100.0f));
    HC05_SendString(",ST=");
    HC05_SendInt32((int32_t)line_status);
    HC05_SendString(",ARM=");
    HC05_SendInt32((int32_t)track_finish_armed);
    HC05_SendString(",FM=");
    HC05_SendInt32((int32_t)finish_marker_frames);
    HC05_SendString(",LT=");
    HC05_SendInt32((int32_t)LineFollower_LeftTargetPercent());
    HC05_SendString(",RT=");
    HC05_SendInt32((int32_t)LineFollower_RightTargetPercent());
    HC05_SendString(",TA=");
    HC05_SendInt32(target_sum->ma);
    HC05_SendString(",TB=");
    HC05_SendInt32(target_sum->mb);
    HC05_SendString(",TC=");
    HC05_SendInt32(target_sum->mc);
    HC05_SendString(",TD=");
    HC05_SendInt32(target_sum->md);
    HC05_SendString(",EA=");
    HC05_SendInt32(encoder_sum->ma);
    HC05_SendString(",EB=");
    HC05_SendInt32(encoder_sum->mb);
    HC05_SendString(",EC=");
    HC05_SendInt32(encoder_sum->mc);
    HC05_SendString(",ED=");
    HC05_SendInt32(encoder_sum->md);
    HC05_SendString(",PA=");
    HC05_SendInt32(speed->pwm_ma);
    HC05_SendString(",PB=");
    HC05_SendInt32(speed->pwm_mb);
    HC05_SendString(",PC=");
    HC05_SendInt32(speed->pwm_mc);
    HC05_SendString(",PD=");
    HC05_SendInt32(speed->pwm_md);
    HC05_SendString("\r\n");
}

/*
 * 堵转触发详情：MASK bit0~3对应MA~MD，P为最后100 ms脉冲，
 * L为连续低脉冲窗口数，C为触发检查时的逐轮PWM命令。
 */
static void send_stall_detail(void)
{
    const MotorProtection_Status *stall = MotorProtection_GetStatus();

    HC05_SendString("STALL_DETAIL,MASK=0x");
    HC05_SendHex8(stall->stalled_mask);
    HC05_SendString(",MA_P=");
    HC05_SendInt32((int32_t)stall->pulses_ma);
    HC05_SendString(",MB_P=");
    HC05_SendInt32((int32_t)stall->pulses_mb);
    HC05_SendString(",MC_P=");
    HC05_SendInt32((int32_t)stall->pulses_mc);
    HC05_SendString(",MD_P=");
    HC05_SendInt32((int32_t)stall->pulses_md);
    HC05_SendString(",MA_L=");
    HC05_SendInt32((int32_t)stall->low_windows_ma);
    HC05_SendString(",MB_L=");
    HC05_SendInt32((int32_t)stall->low_windows_mb);
    HC05_SendString(",MC_L=");
    HC05_SendInt32((int32_t)stall->low_windows_mc);
    HC05_SendString(",MD_L=");
    HC05_SendInt32((int32_t)stall->low_windows_md);
    HC05_SendString(",MA_C=");
    HC05_SendInt32((int32_t)stall->command_ma);
    HC05_SendString(",MB_C=");
    HC05_SendInt32((int32_t)stall->command_mb);
    HC05_SendString(",MC_C=");
    HC05_SendInt32((int32_t)stall->command_mc);
    HC05_SendString(",MD_C=");
    HC05_SendInt32((int32_t)stall->command_md);
    HC05_SendString("\r\n");
}
#endif

/*
 * 实机已经确认PE0高电平会让板载蜂鸣器持续鸣叫，与H60原理图一致。
 * 因此正常运行时将PE0配置为推挽输出低电平，可靠关闭蜂鸣器。
 */
static void board_buzzer_force_off(void)
{
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
    (void)RCC->AHB1ENR;
    GPIOE->BSRRH = (uint16_t)(1U << 0U);
    GPIOE->MODER = (GPIOE->MODER & ~(3UL << (0U * 2U))) |
                   (1UL << (0U * 2U));
    GPIOE->OTYPER &= ~(1UL << 0U);
    GPIOE->PUPDR &= ~(3UL << (0U * 2U));
}

/* 将本帧灰度数据复制到全局变量，便于在Keil Watch中观察和标定。 */
#if !APP_MOTOR_TEST_MODE
static void publish_gray_debug(const GraySensor_Data *gray)
{
    uint32_t index;
    for (index = 0U; index < GRAY_SENSOR_COUNT; index++) {
        gray_raw[index] = gray->value[index];
    }
    gray_active_mask = gray->active_mask;
    gray_active_count = gray->active_count;
    gray_i2c_raw_mask = gray->raw_mask;
}
#endif

