LMN-SCUT/NUEDC-2026-Car/controller-stm32/h60-f407-line-car/User/main.c
/*
 * 灰度测试遥测：每秒发送一行ASCII文本：
 * GRAY,在线状态,I2C错误码,D数字位图,S1..S8,B黑线位图,N见黑数,E误差x100,ST状态
 * S1~S8直接按成功参考工程的方法，把0xDD的8个位展开为白255、黑0。
 * 在线状态为0时先查看错误码，不应把尚未更新的八路0值误认为有效灰度。
 */
#if HC05_TEST_STREAM_ENABLE && !APP_ENABLE_MOTORS
static void send_gray_test_frame(void)
{
    uint32_t index;

    HC05_SendString("GRAY,");
    HC05_SendInt32((int32_t)gray_i2c_online);
    HC05_SendString(",");
    HC05_SendInt32((int32_t)gray_i2c_error);
    HC05_SendString(",D=0x");
    HC05_SendHex8(gray_i2c_raw_mask);
    for (index = 0U; index < GRAY_SENSOR_COUNT; index++) {
        HC05_SendString(",");
        HC05_SendInt32((int32_t)gray_raw[index]);
    }
    HC05_SendString(",B=0x");
    HC05_SendHex8(gray_active_mask);
    HC05_SendString(",N=");
    HC05_SendInt32((int32_t)gray_active_count);
    HC05_SendString(",E=");
    HC05_SendInt32((int32_t)(line_error * 100.0f));
    HC05_SendString(",ST=");
    HC05_SendInt32((int32_t)line_status);
    HC05_SendString("\r\n");
}
#endif

/*
 * 应用主入口。
 *
 * APP_WAIT_START：持续停车、采样并等待PE1按键；
 * APP_RUNNING：周期读取灰度和编码器，只执行环形循迹，满30秒无条件停止；
 * APP_FINISHED：30秒到达后保持短刹车，不使用A点启停线判断；
 * APP_ERROR：ADC异常或持续丢线后保持停车。
 */
int main(void)
{
    uint32_t last_control_ms = 0U;
#if HC05_TEST_STREAM_ENABLE && !APP_ENABLE_MOTORS
    uint32_t last_test_stream_ms = 0U;
#endif
#if APP_MOTOR_TEST_MODE
    uint32_t last_motor_test_report_ms = 0U;
    int32_t motor_test_encoder_ma = 0;
    int32_t motor_test_encoder_mb = 0;
    int32_t motor_test_encoder_mc = 0;
    int32_t motor_test_encoder_md = 0;
    int32_t encoder_total_ma = 0;
    int32_t encoder_total_mb = 0;
    int32_t encoder_total_mc = 0;
    int32_t encoder_total_md = 0;
    uint8_t encoder_pass_mask = 0U;
    const SpeedPI_Status *speed_pi_status;
#endif
    uint32_t run_started_ms = 0U;
#if !APP_MOTOR_TEST_MODE
    GraySensor_Data gray;
    uint32_t last_track_report_ms = 0U;
    uint8_t start_marker_clear_frames = 0U;
    uint8_t finish_marker_frames = 0U;
    uint8_t gray_fault_active = 0U;
    uint32_t last_gray_retry_ms = 0U;
    Encoder_Delta track_encoder_sum = {0, 0, 0, 0};
    Encoder_Delta track_target_sum = {0, 0, 0, 0};
#endif
    Encoder_Delta encoder_delta;

    Timebase_Init();
    board_buzzer_force_off();
    HC05_Init();
#if APP_MOTOR_TEST_MODE
#if ENCODER_PI_TEST_ENABLE
    HC05_SendString("\r\nENCODER PI TEST READY,LIFT WHEELS,PRESS KEY\r\n");
    HC05_SendString("TARGET=70 COUNTS/20MS,REPORT=200MS\r\n");
#else
    HC05_SendString("\r\nENCODER TEST READY,LIFT WHEELS,PRESS KEY\r\n");
#endif
    HC05_SendString("OK bits: bit0=MA,bit1=MB,bit2=MC,bit3=MD\r\n");
#else
    HC05_SendString("\r\nH60 H-MAP TRACK,GRAY+ENCODER_PI,115200\r\n");
    HC05_SendString("START AT A,FACE A->B,CLOCKWISE\r\n");
    HC05_SendString("MAP: T*=TARGET_SUM,E*=ENCODER_SUM,P*=PWM,500MS\r\n");
#endif
    Key_Init();
    Motor_Init();
    Motor_Stop();
    Encoder_Init();
    SpeedPI_Init();
    MotorProtection_Init(Timebase_Millis());
#if APP_MOTOR_TEST_MODE
    /* 电机验证与灰度无关，跳过I2C握手，避免灰度未接时阻塞测试。 */
    gray_i2c_online = 0U;
    gray_i2c_error = 0U;
#else
    gray_i2c_online = NewGray_Init() ? 1U : 0U;
    gray_i2c_error = NewGray_LastError();
    gray_fault_active = (gray_i2c_online == 0U) ? 1U : 0U;
#endif
    LineFollower_Init();

    while (1) {
        if ((uint32_t)(Timebase_Millis() - last_control_ms) <
            APP_CONTROL_PERIOD_MS) {
            continue;
        }
        last_control_ms = Timebase_Millis();

#if APP_MOTOR_TEST_MODE
        /*
         * 四电机正命令验证：
         * PE1按下后，左右两侧统一给正40%命令，运行10秒后普通停车并锁定。
         * 这里的“正”是软件命令正方向；四个轮子的物理前进方向必须架空观察。
         * 当前为纯电机驱动隔离测试，临时关闭编码器堵转判定；正式循迹仍保留保护。
         */
        Encoder_ReadAndReset(&encoder_delta);
        encoder_delta_debug = encoder_delta;

        switch (app_state) {
            case APP_WAIT_START:
                Motor_Stop();
                run_time_ms = 0U;
                if ((uint32_t)(Timebase_Millis() -
                               last_motor_test_report_ms) >= 1000U) {
                    last_motor_test_report_ms = Timebase_Millis();
                    HC05_SendString("WAIT,K=");
                    HC05_SendInt32((int32_t)Key_IsPressed());
                    HC05_SendString("\r\n");
                }
                if (Key_StartPressedEvent() != 0U) {
                    run_started_ms = Timebase_Millis();
                    last_motor_test_report_ms = run_started_ms;
                    motor_test_encoder_ma = 0;
                    motor_test_encoder_mb = 0;
                    motor_test_encoder_mc = 0;
                    motor_test_encoder_md = 0;
                    encoder_total_ma = 0;
                    encoder_total_mb = 0;
                    encoder_total_mc = 0;
                    encoder_total_md = 0;
                    encoder_pass_mask = 0U;
                    MotorProtection_Reset(Timebase_Millis());
#if ENCODER_PI_TEST_ENABLE
                    SpeedPI_Reset();
                    SpeedPI_SetTargets(ENCODER_PI_TEST_TARGET,
                                       ENCODER_PI_TEST_TARGET,
                                       ENCODER_PI_TEST_TARGET,
                                       ENCODER_PI_TEST_TARGET);
#endif
                    app_state = APP_RUNNING;
#if ENCODER_PI_TEST_ENABLE
                    HC05_SendString("KEY_OK,PI_CLOSED_LOOP_START,10S\r\n");
#else
                    HC05_SendString("KEY_OK,ENCODER_TEST_START,40_PERCENT,10S\r\n");
#endif
                }
                break;

            case APP_RUNNING:
                run_time_ms =
                    (uint32_t)(Timebase_Millis() - run_started_ms);
                /*
                 * 汇总最近1秒四路硬件编码器的有符号增量。
                 * 正负号只表示A/B相顺序，当前阶段重点先确认四路绝对值都不为0。
                 */
                motor_test_encoder_ma += encoder_delta.ma;
                motor_test_encoder_mb += encoder_delta.mb;
                motor_test_encoder_mc += encoder_delta.mc;
                motor_test_encoder_md += encoder_delta.md;
                encoder_total_ma += encoder_delta.ma;
                encoder_total_mb += encoder_delta.mb;
                encoder_total_mc += encoder_delta.mc;
                encoder_total_md += encoder_delta.md;
                if (run_time_ms >= APP_MOTOR_TEST_MS) {
#if ENCODER_PI_TEST_ENABLE
                    SpeedPI_Reset();
#else
                    Motor_Stop();
#endif
                    app_state = APP_FINISHED;
                    /*
                     * 最终判定按10秒累计绝对计数完成。门限乘以测试秒数，
                     * 防止某一路只偶发跳动几下也被误认为编码器正常。
                     */
                    encoder_pass_mask = 0U;
                    if ((encoder_total_ma >=
                         (ENCODER_TEST_MIN_COUNTS_1S *
                          (int32_t)(APP_MOTOR_TEST_MS / 1000U))) ||
                        (encoder_total_ma <=
                         -(ENCODER_TEST_MIN_COUNTS_1S *
                           (int32_t)(APP_MOTOR_TEST_MS / 1000U)))) {
                        encoder_pass_mask |= 0x01U;
                    }
                    if ((encoder_total_mb >=
                         (ENCODER_TEST_MIN_COUNTS_1S *
                          (int32_t)(APP_MOTOR_TEST_MS / 1000U))) ||
                        (encoder_total_mb <=
                         -(ENCODER_TEST_MIN_COUNTS_1S *
                           (int32_t)(APP_MOTOR_TEST_MS / 1000U)))) {
                        encoder_pass_mask |= 0x02U;
                    }
                    if ((encoder_total_mc >=
                         (ENCODER_TEST_MIN_COUNTS_1S *
                          (int32_t)(APP_MOTOR_TEST_MS / 1000U))) ||
                        (encoder_total_mc <=
                         -(ENCODER_TEST_MIN_COUNTS_1S *
                           (int32_t)(APP_MOTOR_TEST_MS / 1000U)))) {
                        encoder_pass_mask |= 0x04U;
                    }
                    if ((encoder_total_md >=
                         (ENCODER_TEST_MIN_COUNTS_1S *
                          (int32_t)(APP_MOTOR_TEST_MS / 1000U))) ||
                        (encoder_total_md <=
                         -(ENCODER_TEST_MIN_COUNTS_1S *
                           (int32_t)(APP_MOTOR_TEST_MS / 1000U)))) {
                        encoder_pass_mask |= 0x08U;
                    }

