LMN-SCUT/NUEDC-2026-Car/controller-stm32/h60-f407-line-car/User/main.c
                    HC05_SendString("FINAL,TMA=");
                    HC05_SendInt32(encoder_total_ma);
                    HC05_SendString(",TMB=");
                    HC05_SendInt32(encoder_total_mb);
                    HC05_SendString(",TMC=");
                    HC05_SendInt32(encoder_total_mc);
                    HC05_SendString(",TMD=");
                    HC05_SendInt32(encoder_total_md);
                    HC05_SendString(",OK=0x");
                    HC05_SendHex8(encoder_pass_mask);
                    HC05_SendString("\r\nRESULT,MA=");
                    HC05_SendString((encoder_pass_mask & 0x01U) ?
                                    "PASS" : "FAIL");
                    HC05_SendString(",MB=");
                    HC05_SendString((encoder_pass_mask & 0x02U) ?
                                    "PASS" : "FAIL");
                    HC05_SendString(",MC=");
                    HC05_SendString((encoder_pass_mask & 0x04U) ?
                                    "PASS" : "FAIL");
                    HC05_SendString(",MD=");
                    HC05_SendString((encoder_pass_mask & 0x08U) ?
                                    "PASS" : "FAIL");
                    HC05_SendString("\r\n");
                    if (encoder_pass_mask == 0x0FU) {
                        HC05_SendString("ENCODER_TEST_PASS,ALL_4_OK\r\n");
                    } else {
                        HC05_SendString("ENCODER_TEST_FAIL,CHECK_WIRING\r\n");
                    }
#if ENCODER_PI_TEST_ENABLE
                    {
                        int32_t pi_target_total =
                            (int32_t)(ENCODER_PI_TEST_TARGET *
                            (int32_t)(APP_MOTOR_TEST_MS /
                                      APP_CONTROL_PERIOD_MS));
                        uint8_t pi_pass_ma =
                            pi_total_within_10_percent(encoder_total_ma,
                                                       pi_target_total);
                        uint8_t pi_pass_mb =
                            pi_total_within_10_percent(encoder_total_mb,
                                                       pi_target_total);
                        uint8_t pi_pass_mc =
                            pi_total_within_10_percent(encoder_total_mc,
                                                       pi_target_total);
                        uint8_t pi_pass_md =
                            pi_total_within_10_percent(encoder_total_md,
                                                       pi_target_total);
                    HC05_SendString("PI_TARGET_TOTAL=");
                        HC05_SendInt32(pi_target_total);
                        HC05_SendString("\r\nPI_10PCT,MA=");
                        HC05_SendString(pi_pass_ma ? "PASS" : "FAIL");
                        HC05_SendString(",MB=");
                        HC05_SendString(pi_pass_mb ? "PASS" : "FAIL");
                        HC05_SendString(",MC=");
                        HC05_SendString(pi_pass_mc ? "PASS" : "FAIL");
                        HC05_SendString(",MD=");
                        HC05_SendString(pi_pass_md ? "PASS" : "FAIL");
                        HC05_SendString("\r\n");
                        if (pi_pass_ma && pi_pass_mb &&
                            pi_pass_mc && pi_pass_md) {
                            HC05_SendString("SPEED_PI_TEST_PASS\r\n");
                        } else {
                            HC05_SendString("SPEED_PI_NEEDS_TUNING\r\n");
                        }
                    }
#endif
                    break;
                }

#if ENCODER_PI_TEST_ENABLE
                /*
                 * 闭环测试中PI是唯一PWM写入者：目标固定为每20 ms 70计数，
                 * 四路根据各自编码器反馈独立调节占空比。
                 */
                SpeedPI_Update(&encoder_delta);
#else
                Motor_SetSidePercent(APP_MOTOR_TEST_PERCENT,
                                     APP_MOTOR_TEST_PERCENT);
#endif
                if ((uint32_t)(Timebase_Millis() -
                               last_motor_test_report_ms) >=
#if ENCODER_PI_TEST_ENABLE
                    ENCODER_PI_TEST_REPORT_MS
#else
                    1000U
#endif
                    ) {
                    last_motor_test_report_ms = Timebase_Millis();
#if ENCODER_PI_TEST_ENABLE
                    speed_pi_status = SpeedPI_GetStatus();
                    HC05_SendString("PI,MS=");
                    HC05_SendInt32((int32_t)run_time_ms);
                    HC05_SendString(",T=");
                    HC05_SendInt32((int32_t)(ENCODER_PI_TEST_TARGET *
                        (int32_t)(ENCODER_PI_TEST_REPORT_MS /
                                  APP_CONTROL_PERIOD_MS)));
                    HC05_SendString(",MA=");
                    HC05_SendInt32(motor_test_encoder_ma);
                    HC05_SendString(",MB=");
                    HC05_SendInt32(motor_test_encoder_mb);
                    HC05_SendString(",MC=");
                    HC05_SendInt32(motor_test_encoder_mc);
                    HC05_SendString(",MD=");
                    HC05_SendInt32(motor_test_encoder_md);
                    HC05_SendString(",PA=");
                    HC05_SendInt32(speed_pi_status->pwm_ma);
                    HC05_SendString(",PB=");
                    HC05_SendInt32(speed_pi_status->pwm_mb);
                    HC05_SendString(",PC=");
                    HC05_SendInt32(speed_pi_status->pwm_mc);
                    HC05_SendString(",PD=");
                    HC05_SendInt32(speed_pi_status->pwm_md);
                    HC05_SendString("\r\n");
#else
                    HC05_SendString("RUN,MS=");
                    HC05_SendInt32((int32_t)run_time_ms);
                    HC05_SendString(",ARR=");
                    HC05_SendInt32((int32_t)TIM1->ARR);
                    HC05_SendString(",MA1=");
                    HC05_SendInt32((int32_t)TIM1->CCR1);
                    HC05_SendString(",MA2=");
                    HC05_SendInt32((int32_t)TIM1->CCR2);
                    HC05_SendString(",MB1=");
                    HC05_SendInt32((int32_t)TIM1->CCR3);
                    HC05_SendString(",MB2=");
                    HC05_SendInt32((int32_t)TIM1->CCR4);
                    HC05_SendString(",MC1=");
                    HC05_SendInt32((int32_t)TIM9->CCR1);
                    HC05_SendString(",MC2=");
                    HC05_SendInt32((int32_t)TIM9->CCR2);
                    HC05_SendString(",MD1=");
                    HC05_SendInt32((int32_t)TIM12->CCR1);
                    HC05_SendString(",MD2=");
                    HC05_SendInt32((int32_t)TIM12->CCR2);
                    HC05_SendString(",EMA=");
                    HC05_SendInt32(motor_test_encoder_ma);
                    HC05_SendString(",EMB=");
                    HC05_SendInt32(motor_test_encoder_mb);
                    HC05_SendString(",EMC=");
                    HC05_SendInt32(motor_test_encoder_mc);
                    HC05_SendString(",EMD=");
                    HC05_SendInt32(motor_test_encoder_md);
                    encoder_pass_mask = 0U;
                    if ((motor_test_encoder_ma >=
                         ENCODER_TEST_MIN_COUNTS_1S) ||
                        (motor_test_encoder_ma <=
                         -ENCODER_TEST_MIN_COUNTS_1S)) {
                        encoder_pass_mask |= 0x01U;
                    }
                    if ((motor_test_encoder_mb >=
                         ENCODER_TEST_MIN_COUNTS_1S) ||
                        (motor_test_encoder_mb <=
                         -ENCODER_TEST_MIN_COUNTS_1S)) {
                        encoder_pass_mask |= 0x02U;
                    }
                    if ((motor_test_encoder_mc >=
                         ENCODER_TEST_MIN_COUNTS_1S) ||
                        (motor_test_encoder_mc <=
                         -ENCODER_TEST_MIN_COUNTS_1S)) {
                        encoder_pass_mask |= 0x04U;
                    }
                    if ((motor_test_encoder_md >=
                         ENCODER_TEST_MIN_COUNTS_1S) ||
                        (motor_test_encoder_md <=
                         -ENCODER_TEST_MIN_COUNTS_1S)) {
                        encoder_pass_mask |= 0x08U;
                    }
                    HC05_SendString(",OK=0x");
                    HC05_SendHex8(encoder_pass_mask);
                    HC05_SendString("\r\n");
#endif
                    motor_test_encoder_ma = 0;
                    motor_test_encoder_mb = 0;
                    motor_test_encoder_mc = 0;
                    motor_test_encoder_md = 0;
                }
#if APP_MOTOR_TEST_STALL_CHECK
                if (MotorProtection_Update(Timebase_Millis(),
                                           &encoder_delta)) {
                    Motor_Stop();
                    app_state = APP_ERROR;
                    HC05_SendString("STALL_OR_ENCODER_ERROR,STOP\r\n");
                }
#endif
                break;

