LMN-SCUT/NUEDC-2026-Car/controller-stm32/h60-f407-line-car/User/main.c
                /*
                 * 串级控制：灰度PD只生成左右速度目标，四轮编码器PI才写PWM。
                 * 实车左侧MB/MD共用左目标，右侧MA/MC共用右目标。
                 */
                SpeedPI_SetSidePercentTargets(
                    LineFollower_LeftTargetPercent(),
                    LineFollower_RightTargetPercent());
                SpeedPI_Update(&encoder_delta);
                {
                    const SpeedPI_Status *speed = SpeedPI_GetStatus();
                    track_target_sum.ma += speed->target_ma;
                    track_target_sum.mb += speed->target_mb;
                    track_target_sum.mc += speed->target_mc;
                    track_target_sum.md += speed->target_md;
                }

                if (MotorProtection_Update(Timebase_Millis(),
                                           &encoder_delta)) {
                    send_stall_detail();
                    SpeedPI_Reset();
                    app_state = APP_ERROR;
                    HC05_SendString("STALL_OR_ENCODER_ERROR,STOP\r\n");
                    break;
                }

                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >=
                    APP_TRACK_REPORT_MS) {
                    last_track_report_ms = Timebase_Millis();
                    send_track_test_frame(&track_encoder_sum,
                                          &track_target_sum,
                                          finish_marker_frames);
                    track_encoder_sum.ma = 0;
                    track_encoder_sum.mb = 0;
                    track_encoder_sum.mc = 0;
                    track_encoder_sum.md = 0;
                    track_target_sum.ma = 0;
                    track_target_sum.mb = 0;
                    track_target_sum.mc = 0;
                    track_target_sum.md = 0;
                }
                break;

            case APP_FINISHED:
                Motor_Brake();
                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >= 1000U) {
                    last_track_report_ms = Timebase_Millis();
                    HC05_SendString("STATE,FINISHED,MS=");
                    HC05_SendInt32((int32_t)run_time_ms);
                    HC05_SendString("\r\n");
                }
                break;

            case APP_ERROR:
            default:
                SpeedPI_Reset();
                if ((uint32_t)(Timebase_Millis() -
                               last_track_report_ms) >= 1000U) {
                    last_track_report_ms = Timebase_Millis();
                    HC05_SendString("STATE,ERROR,ON=");
                    HC05_SendInt32((int32_t)gray_i2c_online);
                    HC05_SendString(",I2C=");
                    HC05_SendInt32((int32_t)gray_i2c_error);
                    HC05_SendString("\r\n");
                    if (MotorProtection_GetStatus()->stalled_mask != 0U) {
                        send_stall_detail();
                    }
                }
                break;
        }
#endif
    }
}
